public/blog/01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>A New Dream</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">A New Dream</h1>
<p>
This is my very first post!
</p>

<p>
For the past couple years I have been going over in my head what I should dedicate myself to.
</p>

<p>
I switched jobs from being an insurance agent during a critical time in the industry. I couldn't stomach the insane price points everything was going to, and I had always wanted to do something in media production, so I jumped ship.
</p>

<p>
And then I was unemployed for over a year, trying to get a job in something that I was passionate about (ideally in media production). This proved to be impossible, as the job market was (and is) on a downward spiral in favor of automation via Large Langauge Models. So settled down with a job with family.
</p>

<p>
This job wasn't bad, it was great even. Yet still this quesiton about what I should dedicate my life to was still in my head.
</p>

<p>
So like many others who haven't got a clue what they should do, I went to these fancy language models to think through the problem with me.
</p>

<p>
It essentially told me this:
</p>

<blockquote>
<p>
"You are a Systems Director. Your "ideal purpose" is to identify where the "pipes" of society are clogged (Incentives/Coordination), use your technical mind to design a better "plumbing" system (Architecture), and use your expressive skills to convince the "able-minded people" to help you install it"
</p>
</blockquote>


<p>
Now, I'm not a fan of AI's psychofantic demeanor, (I'm no Systems Direcotor) but I quite liked what we came up.
</p>

<p>
So that's the plan. Moving forward I am going to be in the business of trying to inspire change and bulding a culture around hope and egalitarianism.
</p>

<p>
This means doing research in how things operate, the system in which people operate in, and how people think about it, and formulating strategies on what could be better world.
</p>

<p>
Now, such things are not easy, I have no delusion of that. At this point, I'm facing issues that organizations spend millions of dollars with stacked workforces to solve, alone.
</p>

<p>
But hey, I was already unemployed before, and this is my life's purpose we're talking about here. I might as well try.
</p>

<p>
Such is life, we just gotta try.
</p>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-01-01 Thu 18:00</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 31.0.50 (<a href="https://orgmode.org">Org</a> mode 9.7.11)</p>
</div>
</body>
</html>
